In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

In [2]:
#폐교율 데이터 불러오기
cs_all = pd.read_excel('./cs_all.xlsx', index_col =0)
#학령인구 데이터 불러오기
region_all = pd.read_excel('./region_all.xlsx', index_col =0)

In [3]:
#필요없는 컬럼 제거 (폐교율)
cs_all = cs_all.drop(['폐교년도'], axis =1)

In [4]:
#컬럼명 변경
cs_all = cs_all.rename(columns={'폐교 수' : 'Closed School'})

In [5]:
#필요없는 컬럼 제거 (학령인구)
region_all = region_all.drop(['시점'], axis =1)

In [6]:
#시점 동일 (2001 ~ 2020)
region_all = region_all.iloc[0:20]

In [7]:
#컬럼명 변경
region_all = region_all.rename(columns={'ele' : 'Elementary', 'mid' : 'Middle', 'hig' : 'High', 'all' : 'All'})

In [8]:
region_all

    Elementary  Middle  High   All
0         4150    1847  2014  8011
1         4192    1863  1902  7957
2         4186    1913  1846  7945
3         4118    1993  1824  7935
4         4018    2064  1841  7923
5         3919    2104  1888  7911
6         3808    2095  1966  7869
7         3631    2070  2039  7740
8         3446    2034  2089  7569
9         3280    1985  2084  7349
10        3109    1914  2062  7085
11        2926    1867  2028  6821
12        2783    1818  1985  6586
13        2751    1719  1912  6382
14        2720    1578  1868  6166
15        2688    1458  1816  5962
16        2719    1385  1715  5819
17        2757    1340  1574  5671
18        2765    1318  1454  5537
19        2717    1358  1382  5457

## 2001 ~ 2020 상관관계

In [9]:
#일부 데이터 결합
corr_20012020 = pd.concat([region_all, cs_all], axis =1)

In [10]:
corr_20012020.head()

   Elementary  Middle  High   All  Closed School
0        4150    1847  2014  8011             28
1        4192    1863  1902  7957             26
2        4186    1913  1846  7945             10
3        4118    1993  1824  7935             16
4        4018    2064  1841  7923             21

In [11]:
corr_20012020.to_excel('./corr_20012020.xlsx')

In [12]:
#공분산 분석 (cov)
corr_20012020.cov()

,Elementary,Middle,High,All,Closed School
Elementary,365868.450000,123361.344737,43807.455263,533037.250000,-3270.823684
Middle,123361.344737,77132.028947,43421.350000,243914.723684,-1112.086842
High,43807.455263,43421.350000,39953.313158,127182.118421,-203.576316
All,533037.250000,243914.723684,127182.118421,904134.092105,-4586.486842
Closed School,-3270.823684,-1112.086842,-203.576316,-4586.486842,98.260526

In [13]:
#상관분석 실행 (corr)
cor_reg_clo = corr_20012020.corr(method='pearson')

In [16]:
cor_reg_clo.corr()

               Elementary    Middle      High       All  Closed School
Elementary       1.000000  0.909908  0.584110  0.973927      -0.990466
Middle           0.909908  1.000000  0.857488  0.979504      -0.954843
High             0.584110  0.857488  1.000000  0.751618      -0.684978
All              0.973927  0.979504  0.751618  1.000000      -0.994418
Closed School   -0.990466 -0.954843 -0.684978 -0.994418       1.000000

https://m.blog.naver.com/kiddwannabe/221763497317

In [ ]:
#상관분석 시각화(clustermap)
sns.clustermap(corr, annot = True, cmap = 'RdYlBu_r', vmin = -1, vmax = 1)

In [ ]:
#상관분석 시각화(heatmap)
plt.figure(figsize = (10, 10))

sns.heatmap(corr, annot = True, cmap = 'RdYlBu_r', vmin = -1, vmax = 1)

## 2011 ~ 2020 상관관계

In [ ]:
corr_20112020 = corr_20012020.iloc[10:]

In [ ]:
corr_20112020

In [ ]:
#상관분석 실행
cor_reg_clo_2 = corr_20112020.corr(method='pearson')

In [ ]:
corr_2 = cor_reg_clo_2.corr()

In [ ]:
corr_2

In [ ]:
#상관분석 시각화(clustermap)
sns.clustermap(corr_2, annot = True, cmap = 'RdYlBu_r', vmin = -1, vmax = 1)

In [ ]:
#상관분석 시각화(heatmap)_1
plt.figure(figsize = (10, 10))

sns.heatmap(corr_2, annot = True, cmap = 'RdYlBu_r', vmin = -1, vmax = 1)